EAtest/T18/background/0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    sides
    {
        type            empty;
    }
	
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
	
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    ground
    {
        type            fixedNormalSlip;
        n               (0 0 1);
        value           uniform (0 0 0);
    }
	
    atmosphere
    {
        type            zeroGradient;
    }
    floatingObject
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    oversetPatch
    {
        patchType       overset;
        type            zeroGradient;
    }
    sides1
    {
        patchType       overset;
        type            zeroGradient;
    }
}


// ************************************************************************* //
